; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_11 ?v11 ?v6)
             (pred_4 ?v4 ?v1)
             (pred_9 ?v11 ?v1)
             (pred_7 ?v13 ?v11 )
	     (pred_6 ?v11)
             (pred_10 ?v12)
             (pred_3 ?v4)
             (pred_2 ?v1)
             (pred_8 ?v11)
             (pred_12 ?v4)
             (pred_1 ?v11)
             (pred_5 ))



(:action op_5
:parameters (?v10 ?v3 ?v5 ?v7)
:precondition (and (pred_10 ?v10) (pred_10 ?v3) (pred_3 ?v5) (pred_2 ?v7)
          (pred_11 ?v10 ?v3) (pred_4 ?v5 ?v7)
                   (pred_9 ?v3 ?v7) (pred_6 ?v10) 
                   (pred_8 ?v3) (pred_12 ?v5))
:effect (and  (pred_1 ?v3) (not (pred_8 ?v3))))


(:action op_1
:parameters (?v10 ?v2)
:precondition (and (pred_10 ?v10) (pred_10 ?v2)
               (pred_6 ?v10) (pred_11 ?v10 ?v2) (pred_1 ?v2))
:effect (and (pred_6 ?v2) (not (pred_6 ?v10))))

(:action op_4
:parameters (?v10 ?v5)
:precondition (and (pred_10 ?v10) (pred_3 ?v5) 
                  (pred_6 ?v10) (pred_7 ?v5 ?v10) (pred_5 ))
:effect (and (pred_12 ?v5)
   (not (pred_7 ?v5 ?v10)) (not (pred_5 ))))


(:action op_2
:parameters (?v10 ?v9 ?v8)
:precondition (and (pred_10 ?v10) (pred_3 ?v9) (pred_3 ?v8)
                  (pred_6 ?v10) (pred_12 ?v8) (pred_7 ?v9 ?v10))
:effect (and (pred_12 ?v9) (pred_7 ?v8 ?v10)
        (not (pred_12 ?v8)) (not (pred_7 ?v9 ?v10))))

(:action op_3
:parameters (?v10 ?v5)
:precondition (and (pred_10 ?v10) (pred_3 ?v5) 
                  (pred_6 ?v10) (pred_12 ?v5))
:effect (and (pred_5 ) (pred_7 ?v5 ?v10) (not (pred_12 ?v5)))))

; problem
(define (problem grid-3-3-2-2-2)
    (:domain grid)
    (:objects
    obj_10 obj_03 obj_08 obj_02 obj_05 obj_11 obj_04 obj_09 obj_06
    obj_01 obj_07
    obj_12 obj_13
    )

    (:init
       (pred_5)

       (pred_10 obj_10)
       (pred_10 obj_03)
       (pred_10 obj_08)
       (pred_10 obj_02)
       (pred_10 obj_05)
       (pred_10 obj_11)
       (pred_10 obj_04)
       (pred_10 obj_09)
       (pred_10 obj_06)
       (pred_2 obj_01)
       (pred_2 obj_07)
       (pred_3 obj_12)
       (pred_3 obj_13)

       (pred_11 obj_10 obj_02)
       (pred_11 obj_10 obj_03)
       (pred_11 obj_03 obj_05)
       (pred_11 obj_03 obj_08)
       (pred_11 obj_03 obj_10)
       (pred_11 obj_08 obj_11)
       (pred_11 obj_08 obj_03)
       (pred_11 obj_02 obj_04)
       (pred_11 obj_02 obj_05)
       (pred_11 obj_02 obj_10)
       (pred_11 obj_05 obj_09)
       (pred_11 obj_05 obj_11)
       (pred_11 obj_05 obj_03)
       (pred_11 obj_05 obj_02)
       (pred_11 obj_11 obj_06)
       (pred_11 obj_11 obj_08)
       (pred_11 obj_11 obj_05)
       (pred_11 obj_04 obj_09)
       (pred_11 obj_04 obj_02)
       (pred_11 obj_09 obj_06)
       (pred_11 obj_09 obj_05)
       (pred_11 obj_09 obj_04)
       (pred_11 obj_06 obj_11)
       (pred_11 obj_06 obj_09)
       (pred_8 obj_03)
       (pred_8 obj_10)
       (pred_9  obj_03 obj_01)
       (pred_9  obj_10 obj_07)
       (pred_1 obj_08)
       (pred_1 obj_02)
       (pred_1 obj_05)
       (pred_1 obj_11)
       (pred_1 obj_04)
       (pred_1 obj_09)
       (pred_1 obj_06)

       (pred_4  obj_12 obj_01)
       (pred_4  obj_13 obj_07)
       (pred_7 obj_12 obj_08)
       (pred_7 obj_13 obj_08)
       (pred_6 obj_04)
    )

    (:goal (and
       (pred_7 obj_12 obj_03)
    ))
(:constraints
  (always (not (pred_6 obj_05)))
)
)

; plan
1. (op_1 obj_04 obj_09)
   deleted: (pred_6 obj_04)
   added: (pred_6 obj_09)
   goals met: 0 of 1
2. (op_1 obj_09 obj_06)
   deleted: (pred_6 obj_09)
   added: (pred_6 obj_06)
   goals met: 0 of 1
3. (op_1 obj_06 obj_11)
   deleted: (pred_6 obj_06)
   added: (pred_6 obj_11)
   goals met: 0 of 1
4. (op_1 obj_11 obj_08)
   deleted: (pred_6 obj_11)
   added: (pred_6 obj_08)
   goals met: 0 of 1
5. (op_4 obj_08 obj_12)
   deleted: (pred_7 obj_12 obj_08) (pred_5)
   added: (pred_12 obj_12)
   goals met: 0 of 1
6. (op_5 obj_08 obj_03 obj_12 obj_01)
   deleted: (pred_8 obj_03)
   added: (pred_1 obj_03)
   goals met: 0 of 1
7. (op_1 obj_08 obj_03)
   deleted: (pred_6 obj_08)
   added: (pred_6 obj_03)
   goals met: 0 of 1
8. (op_3 obj_03 obj_12)
   deleted: (pred_12 obj_12)
   added: (pred_5) (pred_7 obj_12 obj_03)
   goals met: 1 of 1
